[
  {
      "date": "2500–1500 BCE",
      "title": "Indus Valley Civilization Period",
      "descr": "The Indus Valley Civilization developed and flourished in the basin of the Indus River, with evidence of early Hindu practices.",
      "color": "#9B6F4D"
  },
  {
      "date": "1500 BCE",
      "title": "Vedic Period Begins",
      "descr": "Debate over Aryan migration versus cultural transformation thesis; the composition of the Rig Veda marks the start of the Vedic Age.",
      "color": "#8C6D3C"
  },
  {
      "date": "800 BCE",
      "title": "Upanishads Written",
      "descr": "The eleven major Upanishads are written, introducing key Hindu concepts like reincarnation, karma, and moksha.",
      "color": "#F4A300"
  },
  {
      "date": "600–500 BCE",
      "title": "Emergence of Buddhism and Jainism",
      "descr": "Buddhism and Jainism break away from the main flow of Hinduism, introducing new spiritual and social ideas.",
      "color": "#D34D4A"
  },
  {
      "date": "500 BCE",
      "title": "Epic and Puranic Texts",
      "descr": "The Epics and Puranas are written, marking the beginning of devotional Hinduism with a focus on deities like Shiva, Vishnu, and Devi.",
      "color": "#4A5D23"
  },
  {
      "date": "400 BCE–800 CE",
      "title": "Hindu Response to Buddhism and Jainism",
      "descr": "Hinduism evolves in response to Buddhism and Jainism; the Gupta Empire fosters the development of Vaishnavism, Shaivism, and Shaktism.",
      "color": "#7A8B93"
  },
  {
      "date": "326 BCE",
      "title": "Alexander the Great’s Invasion",
      "descr": "Alexander’s invasion introduces Hellenic culture to India, influencing local traditions.",
      "color": "#6D8EB0"
  },
  {
      "date": "268–232 BCE",
      "title": "Reign of Ashoka",
      "descr": "Ashoka's rule leads to the promotion of Dharma and Buddhism, impacting Hinduism.",
      "color": "#9D8F57"
  },
  {
      "date": "52 CE–500 CE",
      "title": "Introduction of Christianity",
      "descr": "Christianity is introduced to India, with early presence by Thomas the Apostle and formal establishment by the 6th century CE.",
      "color": "#F5D9A4"
  },
  {
      "date": "200 CE",
      "title": "Codification of Hindu Laws",
      "descr": "Hindu laws are codified, marking a significant development in the legal and social aspects of Hinduism.",
      "color": "#C5A67E"
  },
  {
      "date": "320–500 CE",
      "title": "Gupta Empire",
      "descr": "The Gupta Empire's rise ushers in a period of stability and prosperity, leading to the consolidation of Hindu traditions and Sanskrit literature.",
      "color": "#B4A5B9"
  },
  {
      "date": "500 CE",
      "title": "Fall of Gupta Empire",
      "descr": "The Gupta Empire falls, leading to the fragmentation of India into weaker entities.",
      "color": "#8C6D6A"
  },
  {
      "date": "788 CE",
      "title": "Birth of Adi Sankaracharya",
      "descr": "Adi Sankaracharya, a significant philosopher and scholar, is born, introducing important monotheistic beliefs into Hinduism.",
      "color": "#8D9B6B"
  },
  {
      "date": "800–1000 CE",
      "title": "Bhakti Movements Rise",
      "descr": "The Bhakti movement emphasizes devotion to God, responding to various pressures and reforming Hindu practices.",
      "color": "#E5B4C3"
  },
  {
      "date": "900 CE",
      "title": "Shankara’s Monotheism",
      "descr": "Shankara introduces the concept of one Brahman, bringing significant monotheistic beliefs into Hinduism.",
      "color": "#9E9C6F"
  },
  {
      "date": "950 CE",
      "title": "Queen Sembiyan Madhavi",
      "descr": "Queen Sembiyan Madhavi dedicates her life to building Hindu temples and monasteries.",
      "color": "#CE6E6F"
  },
  {
      "date": "600 CE–1100 CE",
      "title": "Arrival of Islam in India",
      "descr": "Islam arrives in India through trade and invasions, including the introduction of Shia Islam and Turkic invasions.",
      "color": "#7A7F7D"
  },
  {
      "date": "1400–1700 CE",
      "title": "European Arrival",
      "descr": "Europeans arrive in India, impacting Hindu culture and society with their colonial ambitions.",
      "color": "#5D6D6F"
  },
  {
      "date": "1542 CE",
      "title": "Mogul Emperor Akbar",
      "descr": "Akbar's efforts to unite Muslims and Hindus highlight religious tolerance and reform.",
      "color": "#F4A96A"
  },
  {
      "date": "1600 CE",
      "title": "Hindu Renaissance",
      "descr": "The Hindu Renaissance begins, focusing on modern interpretations of Hindu texts and social reform.",
      "color": "#CDA54E"
  },
  {
      "date": "1605 CE",
      "title": "Jahangir’s Rule",
      "descr": "Jahangir’s rule incorporates both Muslim and Hindu teachings.",
      "color": "#7D5A50"
  },
  {
      "date": "1669 CE",
      "title": "Aurangzeb Outlaws Hindu Worship",
      "descr": "Aurangzeb outlaws Hindu worship, leading to forced conversions.",
      "color": "#E27C74"
  },
  {
      "date": "1757 CE",
      "title": "Battle of Plassey",
      "descr": "Robert Clive's victory at the Battle of Plassey ends the Mogul Empire and establishes British dominance.",
      "color": "#8B6D58"
  },
  {
      "date": "1861 CE",
      "title": "British Raj Criminalizes Homosexuality",
      "descr": "Section 377 of the Indian Penal Code criminalizes homosexual activities under British rule.",
      "color": "#9B8C8C"
  },
  {
      "date": "1894 CE",
      "title": "Paramahansa Ramakrishna",
      "descr": "Ramakrishna inspires the Ramakrishna Order; Swami Vivekananda introduces Hinduism to the West.",
      "color": "#D7B56F"
  },
  {
      "date": "1903–04 CE",
      "title": "Indian Immigration to Canada",
      "descr": "Early immigration of Hindus and Sikhs to Canada begins amidst a hostile environment.",
      "color": "#9B6D7F"
  },
  {
      "date": "1908 CE",
      "title": "Canada’s Immigration Policies",
      "descr": "The ‘continuous journey’ legislation effectively bans further Hindu and Sikh immigration to Canada.",
      "color": "#A8A0A3"
  },
  {
      "date": "1919–1947 CE",
      "title": "Era of Mahatma Gandhi",
      "descr": "Mahatma Gandhi’s non-cooperation campaign and leadership in Indian nationalism profoundly impact Hinduism.",
      "color": "#B58C6C"
  },
  {
      "date": "1947 CE",
      "title": "Partition of India",
      "descr": "The partition of India creates major upheaval, leading to widespread violence and displacement.",
      "color": "#D9534F"
  },
  {
      "date": "1955 CE",
      "title": "Hindu Marriage Act",
      "descr": "Enactment of the Hindu Marriage Act and other related laws incorporating Hindu beliefs and practices into Indian law.",
      "color": "#C1D3B4"
  },
  {
      "date": "1960s CE",
      "title": "Migration to the West",
      "descr": "Hindu Indians migrate to Britain and North America; Transcendental Meditation and Hare Krishna movement gain global popularity.",
      "color": "#9B8B71"
  },
  {
      "date": "1966 CE",
      "title": "Indira Gandhi Becomes Prime Minister",
      "descr": "Indira Gandhi becomes the first woman Prime Minister of India.",
      "color": "#6E7D7C"
  },
  {
      "date": "1979 CE",
      "title": "Hindu Temple in Manitoba",
      "descr": "The Hindu Society of Manitoba opens its first Hindu Temple and Cultural Centre in Winnipeg.",
      "color": "#D5A9A8"
  },
  {
      "date": "1990s–Present",
      "title": "Global Hindu Communities",
      "descr": "Hindu communities expand globally; significant temples are built around the world.",
      "color": "#9E8C77"
  },
  {
      "date": "1997 CE",
      "title": "Deepak Obhrai and K. R. Narayanan",
      "descr": "Deepak Obhrai becomes the first Hindu-Canadian elected to Canadian Parliament; K. R. Narayanan becomes President of India.",
      "color": "#F6C3A8"
  },
  {
      "date": "1998 CE",
      "title": "Shabnam Mausi Elected",
      "descr": "Shabnam Mausi becomes India’s first transgender public official.",
      "color": "#CE8B74"
  },
  {
      "date": "2001 CE",
      "title": "Kumbh Mela Festival",
      "descr": "The Kumbh Mela Festival is recognized as the largest religious gathering in the world.",
      "color": "#C4A76F"
  },
  {
      "date": "2007 CE",
      "title": "Shri Swaminarayan Mandir in Toronto",
      "descr": "The Shri Swaminarayan Mandir is consecrated in Toronto, representing a significant Hindu temple in Canada.",
      "color": "#7F8D8D"
  },
  {
      "date": "2011 CE",
      "title": "Legal Recognition of Same-Sex Marriage",
      "descr": "India legalizes same-sex marriage, marking a significant milestone in LGBTQ+ rights.",
      "color": "#9D9E9D"
  },
  {
      "date": "2014 CE",
      "title": "Supreme Court Recognizes Third Gender",
      "descr": "India's Supreme Court officially recognizes hijras and other transgender groups as a third gender.",
      "color": "#7F9B9A"
  },
  {
      "date": "2015 CE",
      "title": "Rights of Transgender Persons Bill",
      "descr": "The Rights of Transgender Persons Bill is passed, guaranteeing various rights and protections.",
      "color": "#B7C3C5"
  },
  {
      "date": "2016 CE",
      "title": "Hindu Heritage Month in Ontario",
      "descr": "Ontario declares October as Hindu Heritage Month, recognizing the contributions of the Hindu community.",
      "color": "#C5D1B5"
  },
  {
      "date": "2017 CE",
      "title": "India Recognizes LGBT Rights",
      "descr": "India’s Supreme Court affirms the LGBT community's right to express their sexual orientation and identity.",
      "color": "#9D9D9D"
  }
]
